In [33]:
import pandas as pd
import numpy as np

In [5]:
from pandas import Series, DataFrame

Series

In [7]:
#Seriesの作成
sample_pandas_data = pd.Series([0,10,20,30,40,50,60,70,80,90])
print(sample_pandas_data)

0     0
1    10
2    20
3    30
4    40
5    50
6    60
7    70
8    80
9    90
dtype: int64

In [8]:
#indexの指定
sample_pandas_index_data = pd.Series([0,10,20,30,40,50,60,70,80,90], index=['a','b','c','d','e','f','g','h','i','j'])
print(sample_pandas_index_data)

a     0
b    10
c    20
d    30
e    40
f    50
g    60
h    70
i    80
j    90
dtype: int64

In [9]:
print('データの値:', sample_pandas_index_data.values)
print('インデックスの値:', sample_pandas_index_data.index)

データの値: [ 0 10 20 30 40 50 60 70 80 90]
インデックスの値: Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'], dtype='object')

DataFrameの使いかた

In [14]:
#DataFrameの作成
attri_data1 = {'ID':['100','101','102','103','104'],
               'City':['Tokyo','Osaka','Kyoto','Hokkaido','Tokyo'],
               'Birth_year':[1990,1989,1992,1997,1982],
               'Name':['Hiroshi','Aiko','Yuki','Satoru','Steve']}

attri_data_frame1 = DataFrame(attri_data1)
print(attri_data_frame1)

    ID      City  Birth_year     Name
0  100     Tokyo        1990  Hiroshi
1  101     Osaka        1989     Aiko
2  102     Kyoto        1992     Yuki
3  103  Hokkaido        1997   Satoru
4  104     Tokyo        1982    Steve

In [15]:
#indexの指定
attri_data_frame_index1 = DataFrame(attri_data1, index=['a','b','c','d','e'])
print(attri_data_frame_index1)

    ID      City  Birth_year     Name
a  100     Tokyo        1990  Hiroshi
b  101     Osaka        1989     Aiko
c  102     Kyoto        1992     Yuki
d  103  Hokkaido        1997   Satoru
e  104     Tokyo        1982    Steve

In [16]:
#jupyter環境での表示
attri_data_frame_index1

    ID      City  Birth_year     Name
a  100     Tokyo        1990  Hiroshi
b  101     Osaka        1989     Aiko
c  102     Kyoto        1992     Yuki
d  103  Hokkaido        1997   Satoru
e  104     Tokyo        1982    Steve

行列操作

In [17]:
#転置(行と列の入れ替え)
attri_data_frame1.T

                  0      1      2         3      4
ID              100    101    102       103    104
City          Tokyo  Osaka  Kyoto  Hokkaido  Tokyo
Birth_year     1990   1989   1992      1997   1982
Name        Hiroshi   Aiko   Yuki    Satoru  Steve

In [18]:
#特定の列の抽出
attri_data_frame1.Birth_year

0    1990
1    1989
2    1992
3    1997
4    1982
Name: Birth_year, dtype: int64

In [21]:
#特定の列の抽出(複数)
attri_data_frame1[['ID','Birth_year']]

    ID  Birth_year
0  100        1990
1  101        1989
2  102        1992
3  103        1997
4  104        1982

In [22]:
#条件抽出
attri_data_frame1[attri_data_frame1['City'] == 'Tokyo']

    ID   City  Birth_year     Name
0  100  Tokyo        1990  Hiroshi
4  104  Tokyo        1982    Steve

In [23]:
#上ではTrueのみを抽出
attri_data_frame1['City'] == 'Tokyo'

0     True
1    False
2    False
3    False
4     True
Name: City, dtype: bool

In [25]:
#条件抽出(複数)
attri_data_frame1[attri_data_frame1['City'].isin(['Tokyo','Osaka'])]

    ID   City  Birth_year     Name
0  100  Tokyo        1990  Hiroshi
1  101  Osaka        1989     Aiko
4  104  Tokyo        1982    Steve

In [26]:
#DataFrameの作成
attri_data2 =  {'ID':['100','101','102','105','107'],
               'Math':[50,43,33,76,98],
               'Emglish':[90,30,20,50,30],
               'Sex':['M','F','F','M','M']}

attri_data_frame2 = DataFrame(attri_data2)
attri_data_frame2

    ID  Math  Emglish Sex
0  100    50       90   M
1  101    43       30   F
2  102    33       20   F
3  105    76       50   M
4  107    98       30   M

In [27]:
#データの結合(keyを指定しないと自動で同じkeyであるものを見つけて結合)
pd.merge(attri_data_frame1,attri_data_frame2)

    ID   City  Birth_year     Name  Math  Emglish Sex
0  100  Tokyo        1990  Hiroshi    50       90   M
1  101  Osaka        1989     Aiko    43       30   F
2  102  Kyoto        1992     Yuki    33       20   F

In [28]:
#集計
attri_data_frame2.groupby('Sex')['Math'].mean()

Sex
F    38.000000
M    74.666667
Name: Math, dtype: float64

In [29]:
#ソート(index)
attri_data_frame1.sort_index()

    ID      City  Birth_year     Name
0  100     Tokyo        1990  Hiroshi
1  101     Osaka        1989     Aiko
2  102     Kyoto        1992     Yuki
3  103  Hokkaido        1997   Satoru
4  104     Tokyo        1982    Steve

In [30]:
#ソート(要素)
attri_data_frame1.Birth_year.sort_values()

4    1982
1    1989
0    1990
2    1992
3    1997
Name: Birth_year, dtype: int64

In [31]:
#値があるかどうかの確認
attri_data_frame1.isin(['Tokyo'])

      ID   City  Birth_year   Name
0  False   True       False  False
1  False  False       False  False
2  False  False       False  False
3  False  False       False  False
4  False   True       False  False

In [34]:
#欠損値の取り扱い
#nameをすべてnan(null)にする
attri_data_frame1['Name'] = np.nan
print(attri_data_frame1)

#nanかどうかの判定
attri_data_frame1.isnull()

    ID      City  Birth_year  Name
0  100     Tokyo        1990   NaN
1  101     Osaka        1989   NaN
2  102     Kyoto        1992   NaN
3  103  Hokkaido        1997   NaN
4  104     Tokyo        1982   NaN

      ID   City  Birth_year  Name
0  False  False       False  True
1  False  False       False  True
2  False  False       False  True
3  False  False       False  True
4  False  False       False  True

In [35]:
#nullを判定し、合計する
attri_data_frame1.isnull().sum()

ID            0
City          0
Birth_year    0
Name          5
dtype: int64